11/data/attachments/39089db47ab924f5.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_1a8d4f6f-c0e7-4d8e-b423-461899ecbeba</nif:username>
            <nif:friendToBeAdded>Margaret_now_Actions_18959_0</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>